#include <spdlog/sinks/basic_file_sink.h>
#include "PCH.h"
#include "common.h"
#include "arg.h"


using namespace SKSE;
using namespace RE;
namespace logger = SKSE::log;

struct RE::TESTopicInfoEvent {
    Actor* speaker;      // 00 - NiTPointer<Actor>
    void* unk04;         // 04 - BSTSmartPointer<REFREventCallbacks::IEventCallback>
    FormID topicInfoID;  // 08
    bool flag;           // 0C

    inline bool IsStarting() const { return !flag; }
    inline bool IsStopping() const { return flag; }
};

class RE::MenuModeChangeEvent {
public:
    enum class Mode { kNone = static_cast<std::underlying_type_t<Mode>>(-1), kHidden = 0, kDisplayed = 1 };

    BSFixedString menu;                         // 00
    stl::enumeration<Mode, std::uint8_t> mode;  // 08
};

class CharEvent : public InputEvent {
public:
    inline static constexpr auto RTTI = RTTI_CharEvent;

    ~CharEvent() override;  // 00

    // members
    std::uint32_t keycode;  // 18
    std::uint32_t pad1C;    // 1C
};

void SetupLog() {
    auto logsFolder = SKSE::log::log_directory();
    if (!logsFolder) {
        SKSE::stl::report_and_fail("SKSE log_directory not provided, logs disabled.");
        return;
    }
    auto pluginName = SKSE::PluginDeclaration::GetSingleton()->GetName();
    auto logFilePath = *logsFolder / std::format("{}.log", pluginName);
    auto fileLoggerPtr = std::make_shared<spdlog::sinks::basic_file_sink_mt>(logFilePath.string(), true);
    auto loggerPtr = std::make_shared<spdlog::logger>("log", std::move(fileLoggerPtr));
    spdlog::set_default_logger(std::move(loggerPtr));
    spdlog::set_level(spdlog::level::trace);
    spdlog::flush_on(spdlog::level::info);
}

struct CustomHandler : public MenuEventHandler {
public:
    ~CustomHandler() override;  // 00

    // override
    bool CanProcess(InputEvent* a_event) override;      // 01
    bool ProcessKinect(KinectEvent* a_event) override;  // 02
